run/cases/pelletExtruder/AMI/SHM/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{  
    
    inlet
    {
        type                flowRateInletVelocity;
        massFlowRate        1e-04;// kg/s  aprox. 0.36 kg/h
        rho                 rho;
        rhoInlet            1040;
        value               uniform (0 0 0);   
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    "barrelup.*"
    {
	type            slip;
    }
      
    "barreldown.*"
    {
	type            noSlip;
    }
    
    "screwup.*"
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }
    
    "screwdown.*"
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }
    
    AMI1
    {
        type            cyclicAMI;
    }
    AMI2
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
